Evaluations/adaptivePerf_TPDS_revision/data/output_2025_Oct_09_0837.txt
Running 20m test @ http://nginx-thrift.social-network2.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 11.438ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 11.731ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 11.309ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 10.907ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 10.933ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 11.215ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 11.387ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 11.471ms, rate sampling interval: 31ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network2.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   257.73ms  245.45ms   1.11s    59.78%
    Req/Sec     6.05     14.94    66.00     84.90%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  234.24ms
 75.000%  399.36ms
 90.000%  509.18ms
 99.000%    1.11s 
 99.900%    1.66s 
 99.990%    2.15s 
 99.999%    3.19s 
100.000%    5.63s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.567     0.000000            1         1.00
      10.279     0.100000         5693         1.11
      12.759     0.200000        11388         1.25
     149.247     0.300000        17333         1.43
     150.783     0.400000        22976         1.67
     234.239     0.500000        28491         2.00
     235.391     0.550000        31390         2.22
     236.287     0.600000        34569         2.50
     237.183     0.650000        36991         2.86
     265.471     0.700000        39828         3.33
     399.359     0.750000        42835         4.00
     430.335     0.775000        44091         4.44
     506.111     0.800000        45831         5.00
     506.623     0.825000        47009         5.71
     507.391     0.850000        48829         6.67
     507.903     0.875000        49839         8.00
     508.415     0.887500        50593         8.89
     509.183     0.900000        51254        10.00
     519.167     0.912500        51914        11.43
     581.119     0.925000        52640        13.33
     649.727     0.937500        53337        16.00
     678.911     0.943750        53691        17.78
     707.583     0.950000        54046        20.00
     748.031     0.956250        54404        22.86
     794.111     0.962500        54758        26.67
     844.287     0.968750        55113        32.00
     871.935     0.971875        55290        35.56
     900.095     0.975000        55468        40.00
     931.839     0.978125        55648        45.71
     965.119     0.981250        55825        53.33
     993.791     0.984375        56002        64.00
    1011.711     0.985938        56094        71.11
    1039.871     0.987500        56181        80.00
    1088.511     0.989062        56268        91.43
    1127.423     0.990625        56357       106.67
    1176.575     0.992188        56446       128.00
    1207.295     0.992969        56490       142.22
    1242.111     0.993750        56536       160.00
    1270.783     0.994531        56579       182.86
    1306.623     0.995313        56624       213.33
    1349.631     0.996094        56669       256.00
    1376.255     0.996484        56691       284.44
    1400.831     0.996875        56713       320.00
    1430.527     0.997266        56735       365.71
    1460.223     0.997656        56757       426.67
    1498.111     0.998047        56779       512.00
    1526.783     0.998242        56790       568.89
    1553.407     0.998437        56802       640.00
    1589.247     0.998633        56813       731.43
    1620.991     0.998828        56824       853.33
    1672.191     0.999023        56835      1024.00
    1695.743     0.999121        56840      1137.78
    1730.559     0.999219        56846      1280.00
    1756.159     0.999316        56852      1462.86
    1788.927     0.999414        56857      1706.67
    1821.695     0.999512        56863      2048.00
    1835.007     0.999561        56865      2275.56
    1853.439     0.999609        56868      2560.00
    1874.943     0.999658        56871      2925.71
    1904.639     0.999707        56874      3413.33
    1946.623     0.999756        56877      4096.00
    1959.935     0.999780        56878      4551.11
    1974.271     0.999805        56879      5120.00
    1985.535     0.999829        56881      5851.43
    2000.895     0.999854        56882      6826.67
    2154.495     0.999878        56884      8192.00
    2154.495     0.999890        56884      9102.22
    2162.687     0.999902        56885     10240.00
    2295.807     0.999915        56886     11702.86
    2295.807     0.999927        56886     13653.33
    2385.919     0.999939        56887     16384.00
    2385.919     0.999945        56887     18204.44
    2390.015     0.999951        56888     20480.00
    2390.015     0.999957        56888     23405.71
    2390.015     0.999963        56888     27306.67
    3192.831     0.999969        56889     32768.00
    3192.831     0.999973        56889     36408.89
    3192.831     0.999976        56889     40960.00
    3192.831     0.999979        56889     46811.43
    3192.831     0.999982        56889     54613.33
    5627.903     0.999985        56890     65536.00
    5627.903     1.000000        56890          inf
#[Mean    =      257.730, StdDeviation   =      245.452]
#[Max     =     5623.808, Total count    =        56890]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  57415 requests in 20.00m, 16.46MB read
  Socket errors: connect 0, read 0, write 0, timeout 21233
  Non-2xx or 3xx responses: 21
Requests/sec:     47.84  
Transfer/sec:     14.05KB