Evaluations/adaptivePerf_TPDS_revision/data/output_2025_Oct_09_0915.txt
Running 20m test @ http://nginx-thrift.social-network2.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 445.854ms, rate sampling interval: 2680ms
  Thread calibration: mean lat.: 13.784ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 144.665ms, rate sampling interval: 1052ms
  Thread calibration: mean lat.: 176.672ms, rate sampling interval: 580ms
  Thread calibration: mean lat.: 85.990ms, rate sampling interval: 257ms
  Thread calibration: mean lat.: 393.064ms, rate sampling interval: 99ms
  Thread calibration: mean lat.: 81.600ms, rate sampling interval: 255ms
  Thread calibration: mean lat.: 12.440ms, rate sampling interval: 27ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network2.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   255.13ms  243.13ms   1.08s    60.79%
    Req/Sec     6.00     13.71    40.00     88.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  234.24ms
 75.000%  399.10ms
 90.000%  509.18ms
 99.000%    1.08s 
 99.900%    1.65s 
 99.990%    2.75s 
 99.999%    5.41s 
100.000%    5.62s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.231     0.000000            1         1.00
      10.039     0.100000         5702         1.11
      12.359     0.200000        11384         1.25
     149.119     0.300000        17135         1.43
     150.655     0.400000        22812         1.67
     234.239     0.500000        28586         2.00
     235.391     0.550000        31400         2.22
     236.287     0.600000        34559         2.50
     237.311     0.650000        37167         2.86
     264.447     0.700000        39826         3.33
     399.103     0.750000        42771         4.00
     401.151     0.775000        44174         4.44
     505.087     0.800000        45574         5.00
     506.367     0.825000        47133         5.71
     507.135     0.850000        48753         6.67
     507.903     0.875000        50160         8.00
     508.159     0.887500        50494         8.89
     509.183     0.900000        51323        10.00
     516.863     0.912500        51916        11.43
     578.047     0.925000        52628        13.33
     643.071     0.937500        53342        16.00
     665.599     0.943750        53700        17.78
     691.711     0.950000        54049        20.00
     724.479     0.956250        54405        22.86
     766.463     0.962500        54764        26.67
     822.783     0.968750        55116        32.00
     853.503     0.971875        55295        35.56
     884.223     0.975000        55471        40.00
     915.967     0.978125        55650        45.71
     947.199     0.981250        55827        53.33
     978.943     0.984375        56005        64.00
     994.815     0.985938        56093        71.11
    1015.295     0.987500        56183        80.00
    1053.695     0.989062        56273        91.43
    1102.847     0.990625        56362       106.67
    1149.951     0.992188        56449       128.00
    1170.431     0.992969        56493       142.22
    1201.151     0.993750        56539       160.00
    1234.943     0.994531        56583       182.86
    1270.783     0.995313        56629       213.33
    1312.767     0.996094        56672       256.00
    1334.271     0.996484        56693       284.44
    1378.303     0.996875        56716       320.00
    1397.759     0.997266        56738       365.71
    1430.527     0.997656        56760       426.67
    1465.343     0.998047        56782       512.00
    1497.087     0.998242        56793       568.89
    1537.023     0.998437        56805       640.00
    1579.007     0.998633        56816       731.43
    1626.111     0.998828        56827       853.33
    1661.951     0.999023        56839      1024.00
    1680.383     0.999121        56843      1137.78
    1712.127     0.999219        56849      1280.00
    1744.895     0.999316        56855      1462.86
    1781.759     0.999414        56860      1706.67
    1816.575     0.999512        56866      2048.00
    1832.959     0.999561        56868      2275.56
    1867.775     0.999609        56871      2560.00
    1917.951     0.999658        56874      2925.71
    2061.311     0.999707        56877      3413.33
    2150.399     0.999756        56880      4096.00
    2152.447     0.999780        56881      4551.11
    2201.599     0.999805        56883      5120.00
    2203.647     0.999829        56884      5851.43
    2303.999     0.999854        56885      6826.67
    2748.415     0.999878        56887      8192.00
    2748.415     0.999890        56887      9102.22
    2828.287     0.999902        56888     10240.00
    3184.639     0.999915        56889     11702.86
    3184.639     0.999927        56889     13653.33
    3704.831     0.999939        56890     16384.00
    3704.831     0.999945        56890     18204.44
    5058.559     0.999951        56891     20480.00
    5058.559     0.999957        56891     23405.71
    5058.559     0.999963        56891     27306.67
    5406.719     0.999969        56892     32768.00
    5406.719     0.999973        56892     36408.89
    5406.719     0.999976        56892     40960.00
    5406.719     0.999979        56892     46811.43
    5406.719     0.999982        56892     54613.33
    5619.711     0.999985        56893     65536.00
    5619.711     1.000000        56893          inf
#[Mean    =      255.133, StdDeviation   =      243.127]
#[Max     =     5615.616, Total count    =        56893]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  57410 requests in 20.00m, 16.46MB read
  Socket errors: connect 0, read 0, write 0, timeout 21248
  Non-2xx or 3xx responses: 19
Requests/sec:     47.84  
Transfer/sec:     14.04KB